import copy

# # 1.普通赋值
# a=[1,2]
# b=[3,4]
# c=[a,b]
# d=c
# print(id(c),id(d))
# '''
# 输出结果：
# 3103405504576 3103405504576
# '''
#
# # # 2.浅拷贝可变类型
# a=[1,2]
# b=[3,4]
# c=[a,b]
# d=copy.copy(c)
# print(id(c),id(d))
# '''
# 输出结果：
# 2111496320192 2111496322432
# '''
#
# # 3.浅拷贝-深层数据
# a=[1,2]
# b=[3,4]
# c=[a,b]
# d=copy.copy(c)
# print(id(c[1]),id(d[1]))
# '''
# 输出结果：
# 2809475170880 2809475170880
# '''
#
# # 4.浅拷贝不可变类型
# a=[1,2]
# b=[3,4]
# c=(a,b)
# d=copy.copy(c)
# print(id(c),id(d))
# '''
# 输出结果：
# 2262507779648 2262507779648
# '''

# 5.深拷贝可变类型

# 6.深拷贝不可变类型-子对象有可变类型
a=[1,2]
b=[3,4]
c=(a,b)
d=copy.deepcopy(c)
print(id(c),id(d))
'''
输出结果：
1954111551872 1954111551168
'''
# 6.深拷贝不可变类型-子对象没有可变类型
a=(1,2)
b=(3,4)
c=(a,b)
d=copy.deepcopy(c)
print(id(c),id(d))
'''
输出结果：
1954111717568 1954111717568
'''